In [1]:
import numpy as np
import pandas as pd

## Series / Seriler

In [8]:
dictionary = {"Anıl": 50, "Cemal": 30, "Yaşar": 20}

In [10]:
data = pd.Series(dictionary)
type(data)

pandas.core.series.Series

In [11]:
data

Anıl     50
Cemal    30
Yaşar    20
dtype: int64

In [12]:
myNames = "Anıl Cemal Yaşar".split()
myAges = [50,30,20]

In [16]:
newData = pd.Series(data=myAges, index=myNames)
newData

Anıl     50
Cemal    30
Yaşar    20
dtype: int64

In [28]:
results1 = pd.Series(index=["Anıl", "Atlas", "Osman"], data=[10,5,1])
results1

Anıl     10
Atlas     5
Osman     1
dtype: int64

In [29]:
results2 = pd.Series(data=[20,10,8], index="Anıl Atlas Osman".split())
results2

Anıl     20
Atlas    10
Osman     8
dtype: int64

In [30]:
results2["Osman"]

8

In [32]:
# tüm index ler eşleştiği için toplarken sorun olmadı
endResult = results1 + results2
endResult

Anıl     30
Atlas    15
Osman     9
dtype: int64

In [35]:
diffSeries1 = pd.Series(data=[10,5,3,1], index="a b c d".split())
diffSeries2 = pd.Series(data=[20,12,8,14], index="a e c f".split())

In [36]:
diffSeries1

a    10
b     5
c     3
d     1
dtype: int64

In [37]:
diffSeries2

a    20
e    12
c     8
f    14
dtype: int64

In [39]:
# Yalnızca eşleşen field lar toplandı, eşleşmeyenler NaN value döndü
diffSeries1 + diffSeries2

a    30.0
b     NaN
c    11.0
d     NaN
e     NaN
f     NaN
dtype: float64

## DataFrame

In [2]:
matrix = np.random.randn(4,3)
matrix

array([[ 0.20466711, -1.14457154,  0.27970375],
       [-1.6558147 ,  0.01663283,  0.01731971],
       [ 1.30398493, -0.29964773, -1.95761669],
       [-0.27961588,  2.56938426, -0.07389774]])

In [4]:
df = pd.DataFrame(data=matrix, columns="A B C".split())
df

          A         B         C
0  0.204667 -1.144572  0.279704
1 -1.655815  0.016633  0.017320
2  1.303985 -0.299648 -1.957617
3 -0.279616  2.569384 -0.073898

In [6]:
# First column
df['A']

0    0.204667
1   -1.655815
2    1.303985
3   -0.279616
Name: A, dtype: float64

In [7]:
# Second column
df['B']

0   -1.144572
1    0.016633
2   -0.299648
3    2.569384
Name: B, dtype: float64

In [9]:
dfNew = pd.DataFrame(data=matrix, index = "Anıl Atil Zeynep Atlas".split(),
                    columns="Maas Yas CalismaSaati".split())
dfNew

            Maas       Yas  CalismaSaati
Anıl    0.204667 -1.144572      0.279704
Atil   -1.655815  0.016633      0.017320
Zeynep  1.303985 -0.299648     -1.957617
Atlas  -0.279616  2.569384     -0.073898

In [10]:
# Age of employees
dfNew["Yas"]

Anıl     -1.144572
Atil      0.016633
Zeynep   -0.299648
Atlas     2.569384
Name: Yas, dtype: float64

In [11]:
# Shift hours of employees
dfNew["CalismaSaati"]

Anıl      0.279704
Atil      0.017320
Zeynep   -1.957617
Atlas    -0.073898
Name: CalismaSaati, dtype: float64

In [12]:
dfNew[["Maas", "Yas"]]

            Maas       Yas
Anıl    0.204667 -1.144572
Atil   -1.655815  0.016633
Zeynep  1.303985 -0.299648
Atlas  -0.279616  2.569384

In [16]:
# Row based
dfNew.loc["Atil"]

Maas           -1.655815
Yas             0.016633
CalismaSaati    0.017320
Name: Atil, dtype: float64

In [15]:
dfNew.iloc[1]

Maas           -1.655815
Yas             0.016633
CalismaSaati    0.017320
Name: Atil, dtype: float64

In [19]:
dfNew["Emeklilik Yasi"] = dfNew["Yas"] * 2
dfNew

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Anıl    0.204667 -1.144572      0.279704       -2.289143
Atil   -1.655815  0.016633      0.017320        0.033266
Zeynep  1.303985 -0.299648     -1.957617       -0.599295
Atlas  -0.279616  2.569384     -0.073898        5.138769

In [21]:
dfNew.drop("Emeklilik Yasi", axis=1)

            Maas       Yas  CalismaSaati
Anıl    0.204667 -1.144572      0.279704
Atil   -1.655815  0.016633      0.017320
Zeynep  1.303985 -0.299648     -1.957617
Atlas  -0.279616  2.569384     -0.073898

In [22]:
dfNew.drop("Anıl")

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Atil   -1.655815  0.016633      0.017320        0.033266
Zeynep  1.303985 -0.299648     -1.957617       -0.599295
Atlas  -0.279616  2.569384     -0.073898        5.138769

In [23]:
# Dropping columns and rows had no effect on actual data frame
dfNew

            Maas       Yas  CalismaSaati  Emeklilik Yasi
Anıl    0.204667 -1.144572      0.279704       -2.289143
Atil   -1.655815  0.016633      0.017320        0.033266
Zeynep  1.303985 -0.299648     -1.957617       -0.599295
Atlas  -0.279616  2.569384     -0.073898        5.138769

In [24]:
# we should write inplace=True that changes will updated
dfNew.drop("Emeklilik Yasi", axis=1, inplace=True)
dfNew

            Maas       Yas  CalismaSaati
Anıl    0.204667 -1.144572      0.279704
Atil   -1.655815  0.016633      0.017320
Zeynep  1.303985 -0.299648     -1.957617
Atlas  -0.279616  2.569384     -0.073898

In [28]:
# dfNew.loc["Atil"][0]
# dfNew.loc["Atil"]["Maas"]
dfNew.loc["Atil", "Maas"]

-1.6558147030193067

In [33]:
dfNew[dfNew["Maas"] > 0]

            Maas       Yas  CalismaSaati
Anıl    0.204667 -1.144572      0.279704
Zeynep  1.303985 -0.299648     -1.957617

In [34]:
dfNew[dfNew["Yas"] > 0]

           Maas       Yas  CalismaSaati
Atil  -1.655815  0.016633      0.017320
Atlas -0.279616  2.569384     -0.073898

In [38]:
dfNew[(dfNew["Yas"] > 0) & (dfNew["Maas"] < 0)]

           Maas       Yas  CalismaSaati
Atil  -1.655815  0.016633      0.017320
Atlas -0.279616  2.569384     -0.073898

In [39]:
# Reset indices
dfNew.reset_index()

    index      Maas       Yas  CalismaSaati
0    Anıl  0.204667 -1.144572      0.279704
1    Atil -1.655815  0.016633      0.017320
2  Zeynep  1.303985 -0.299648     -1.957617
3   Atlas -0.279616  2.569384     -0.073898

In [42]:
indexList = "Ati Zey Atl Meh".split()
dfNew["New index"] = indexList
dfNew

            Maas       Yas  CalismaSaati New index
Anıl    0.204667 -1.144572      0.279704       Ati
Atil   -1.655815  0.016633      0.017320       Zey
Zeynep  1.303985 -0.299648     -1.957617       Atl
Atlas  -0.279616  2.569384     -0.073898       Meh

In [45]:
dfNew.set_index("New index", inplace = True)

In [46]:
dfNew

               Maas       Yas  CalismaSaati
New index
Ati        0.204667 -1.144572      0.279704
Zey       -1.655815  0.016633      0.017320
Atl        1.303985 -0.299648     -1.957617
Meh       -0.279616  2.569384     -0.073898

In [47]:
dfNew.loc["Ati"]

Maas            0.204667
Yas            -1.144572
CalismaSaati    0.279704
Name: Ati, dtype: float64

In [48]:
firstIndex = ["Simpson","Simpson","Simpson", "South Park", "South Park", "South Park"]

In [49]:
insideIndex = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [50]:
mergedIndexes = list(zip(firstIndex, insideIndex))

In [51]:
mergedDf = pd.MultiIndex.from_tuples(mergedIndexes)
mergedDf

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [52]:
cartoonsList = [[40,"A"], [10, "B"], [30, "C"], [9, "D"], [10, "E"], [11,"F"]]

In [53]:
cartoonsArray = np.array(cartoonsList)

In [54]:
cartoonsDf = pd.DataFrame(data=cartoonsArray, index=mergedDf, columns=["Yas", "Meslek"])

In [55]:
cartoonsDf

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [57]:
cartoonsDf.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [58]:
cartoonsDf.loc["Simpson"].loc["Bart"]

Yas       10
Meslek     B
Name: Bart, dtype: object

In [59]:
weather = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38]}

In [60]:
weatherDf = pd.DataFrame(weather)

In [61]:
weatherDf

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [62]:
weatherDf.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [72]:
# Minimum 2 normal values should have given
weatherDf.dropna(axis=1, thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [73]:
weatherDf.fillna(20)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0    20.0     39
2      20.0    25.0     38

In [76]:
weatherDf["Ankara"].fillna(20)

0    20.0
1    20.0
2    25.0
Name: Ankara, dtype: float64

## groupby

In [80]:
salaryDict = {"Department": ["Software", "Software", "Finans", "Finans", "Hukuk", "Hukuk"],
            "Employee Name": ["Ahmet", "Mehmet", "Atil", "Burak", "Zeynep", "Fatma"],
             "Salary": [100, 150, 200, 300 ,400, 500] 
             }

In [81]:
salaryDf = pd.DataFrame(salaryDict)

In [82]:
salaryDf

  Department Employee Name  Salary
0   Software         Ahmet     100
1   Software        Mehmet     150
2     Finans          Atil     200
3     Finans         Burak     300
4      Hukuk        Zeynep     400
5      Hukuk         Fatma     500

In [83]:
groupObject = salaryDf.groupby("Department")

In [84]:
groupObject.count()

            Employee Name  Salary
Department
Finans                  2       2
Hukuk                   2       2
Software                2       2

In [86]:
# Mean of employees which are grouped by their departments
groupObject.mean()

C:\Users\msi\AppData\Local\Temp\ipykernel_5116\2639455978.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupObject.mean()

            Salary
Department
Finans       250.0
Hukuk        450.0
Software     125.0

In [88]:
# All of statistical informations about groups
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Finans        2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Hukuk         2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Software      2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## merging

In [89]:
dict1 = {"Isim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
        "Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"]
        }

In [90]:
df1 = pd.DataFrame(dict1)
df1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [91]:
dict2 = {"Isim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
        "Koşu": [100,200,300,400]
        }

In [92]:
df2 = pd.DataFrame(dict2)
df2

     Isim  Koşu
0   Ahmet   100
1  Mehmet   200
2  Zeynep   300
3    Atıl   400

In [95]:
# on parameter indicates on which column data frames will be merged
mergedDf = pd.merge(df1, df2, on="Isim")

In [96]:
mergedDf

     Isim       Spor  Koşu
0   Ahmet       Koşu   100
1  Mehmet      Yüzme   200
2  Zeynep       Koşu   300
3    Atıl  Basketbol   400

In [98]:
mergedDf["Spor"].unique()

array(['Koşu', 'Yüzme', 'Basketbol'], dtype=object)

In [99]:
mergedDf["Spor"].nunique()

3

In [100]:
mergedDf["Spor"].value_counts()

Koşu         2
Yüzme        1
Basketbol    1
Name: Spor, dtype: int64

In [101]:
def nabizHesapla(kosu):
    return kosu * 0.4

In [102]:
# We can give all rows as parameter in a function
mergedDf["Koşu"].apply(nabizHesapla)

0     40.0
1     80.0
2    120.0
3    160.0
Name: Koşu, dtype: float64